
#### 📖 Terraform Plan Result for `gcp-terraform-360408`: `success`

<details><summary>Show Plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_scheduler_job.test_scheduler will be created
  + resource "google_cloud_scheduler_job" "test_scheduler" {
      + id        = (known after apply)
      + name      = "gcp-terraform-360408-test"
      + project   = (known after apply)
      + region    = (known after apply)
      + schedule  = "* * * * *"
      + time_zone = "Asia/Tokyo"

      + pubsub_target {
          + data       = "dGVzdCE="
          + topic_name = (known after apply)
        }
    }

  # google_cloudfunctions_function.test_function will be created
  + resource "google_cloudfunctions_function" "test_function" {
      + available_memory_mb           = 256
      + entry_point                   = "helloWorld"
      + environment_variables         = {
          + "BUCKET_NAME" = "gcp-terraform-360408-test-functions-source"
          + "PROJECT_ID"  = "gcp-terraform-360408"
        }
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = 1
      + name                          = "gcp-terraform-360408-test-function"
      + project                       = (known after apply)
      + region                        = "us-central1"
      + runtime                       = "nodejs16"
      + service_account_email         = (known after apply)
      + source_archive_bucket         = "gcp-terraform-360408-test-functions-source"
      + source_archive_object         = "0221d668f0092ef65198282844197abb.zip"
      + timeout                       = 60
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger {
          + event_type = "google.pubsub.topic.publish"
          + resource   = "gcp-terraform-360408-test-topic"

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_pubsub_topic.test_function will be created
  + resource "google_pubsub_topic" "test_function" {
      + id      = (known after apply)
      + name    = "gcp-terraform-360408-test-topic"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_storage_bucket.cloud_functions_source will be created
  + resource "google_storage_bucket" "cloud_functions_source" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "gcp-terraform-360408-test-functions-source"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # google_storage_bucket_object.test_function_source will be created
  + resource "google_storage_bucket_object" "test_function_source" {
      + bucket         = "gcp-terraform-360408-test-functions-source"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "0221d668f0092ef65198282844197abb.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./functions/test_functions.zip"
      + storage_class  = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
```

</details>

This plan result will be updated when the `Terraform Plan` workflow re-run.